import { ModuleInfo } from "../types/common"
import { ModuleType } from "../types/module.types"

export const modulesList: ModuleInfo[] = [
  {
    "id": 1,
    "type": ModuleType.TEXT,
    "title": "Трохи тепла",
    "description": "Іноді кількох простих слів достатньо, щоб нагадати важливій людині, як багато вона для тебе означає. Почни свою маленьку історію з теплого привітання, щирого зізнання або просто милого повідомлення.",
    "image": "../../src/assets/homepage/module_1.jpg"
  },
  {
    "id": 2,
    "type": ModuleType.QUESTION_TEXT,
    "title": "А ти пам’ятаєш?",
    "description": "Додай маленьке питання, відповідь на яке знає лише людина, що добре тебе знає. Це може бути ваш спільний спогад, улюблена річ або кумедна дрібниця, про яку знаєте тільки ви.",
    "image": "../../src/assets/homepage/module_2.jpg"
  },
  {
    "id": 3,
    "type": ModuleType.PUZZLE_LETTER,
    "title": "Збери спогад",
    "description": "Одне особливе фото заховалося за десятками маленьких шматочків — доведеться трохи попрацювати, щоб побачити його знову. А коли пазл буде складено, на тебе чекатиме ще один маленький сюрприз.",
    "image": "../../src/assets/homepage/module_3.jpg"
  },
  {
    "id": 4,
    "type": ModuleType.TEXT_IMG,
    "title": "Одна маленька історія",
    "description": "Є моменти, фотографії та слова, якими хочеться поділитися саме зараз. Додай до своєї історії красиве фото і розкажи все, що давно хотілося сказати.",
    "image": "../../src/assets/homepage/module_4.jpg"
  },
  {
    "id": 5,
    "type": ModuleType.IMGS,
    "title": "Наші моменти",
    "description": "Деякі фотографії зберігають набагато більше, ніж просто зображення — вони повертають у певний день, місце та відчуття. Збери свої найулюбленіші моменти в одну маленьку галерею, до якої захочеться повертатися.",
    "image": "../../src/assets/homepage/module_5.jpg"
  }
]